# RebarCurvesData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarCurvesData Class
Members See Also
---
The class that contains the information needed to calculate and return the result of the external curve generation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class RebarCurvesData : IDisposable
```

Visual Basic
---
```text
Public Class RebarCurvesData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RebarCurvesData : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarCurvesData
# See Also
RebarCurvesData Members
Autodesk.Revit.DB.Structure Namespace